class MyNum:
    """
    নিচের উদাহরণে, MyNum ক্লাস এর ইন্সট্যান্স হিসেবে আমরা দুটো অবজেক্ট তৈরি করলাম এবং এদের প্রত্যেকের value সেট করলাম 2 এবং 3. 
    এরপর এই দুটি অবজেক্টকে সাধারণ যোগ চিহ্ন দিয়ে যোগ করলাম। আমরা চাচ্ছি এই স্পেশাল নাম্বার দুটো একটু আলাদা ভাবে আমাদের নিজেদের 
    মত করে যোগ হয়ে ফিরে আসুক। এক্ষেত্রে, c = a + b লাইনে বস্তুত c = a.__add__(b) স্টেটমেন্টটি এক্সিকিউট হবে। 
    অর্থাৎ a অবজেক্টের __add__ মেথড কল হবে এবং এর মধ্যে প্রথমে 2 এর ভ্যালু দিগুণ হবে, 
    অতঃপর b অবজেক্ট তথা other প্যারামিটার এর value 3 ও দিগুণ হবে। পরিশেষে এদের যোগ ফল রিটার্ন হবে। অর্থাৎ আউটপুট,
    """

    def __init__(self, value):
        self.value = value

    def __add__(self, other):
        return (self.value * 2) + (other.value * 3)


# ==============================================
a = MyNum(2)
b = MyNum(3)
c = a + b
print(c)
